{
  "name": "Boris Brodsky",
  "title": "Digital Transformation and Innovation | Lifetime Learner | Ex-Auranda/Accenture | Sitecore Technology MVP",
  "about": "Boris Brodsky is a seasoned technology leader with over 20 years of driving enterprise digital transformation, innovation, and strategy. He specializes in cloud solutions, data analytics, and digital experience platforms. Mr. Brodsky is responsible for leading teams, developing solutions, and delivering impactful results for clients across various industries, including healthcare, automotive, and energy. Based in Maryland, Mr. Brodsky is recognized for his expertise in digital strategy and innovation.\n\nPrior to his current endeavors, Mr. Brodsky served as Head of Data, Insights, and Analytics at Zonet Digital, where he led data strategy and solution architecture for enterprise customers. From 2015 to 2021, he was the AVP of Digital at Auranda, focusing on cloud architecture and digital innovation. Earlier in his career, Mr. Brodsky held roles such as Director of Technology Leadership at Accenture and Digital Application Architect at Accenture, where he contributed to the development of cloud-based solutions and digital platforms.\n\nMr. Brodsky holds a Master of Science in Information Technology and a Bachelor of Science in Database Management from Towson University. He is also certified as a Sitecore 10 .NET Developer and AWS Certified Data Engineer - Associate. His professional achievements include being recognized as a Sitecore Technology MVP multiple times, showcasing his dedication to advancing digital transformation and technology solutions.",
  "contact": "",
  "office": "Maryland, United States",
  "email": "",
  "phone": "",
  "industries": [
    "Digital Transformation",
    "Cloud Computing",
    "Data Analytics",
    "Healthcare",
    "Automotive"
  ],
  "education": [
    {
      "degree": "Master of Science in Information Technology",
      "institution": "Towson University",
      "year": "2007",
      "description": ""
    },
    {
      "degree": "Bachelor of Science in Database Management",
      "institution": "Towson University",
      "year": "2005",
      "description": ""
    }
  ],
  "certifications": [
    {
      "name": "Sitecore 10 .NET Developer Certification",
      "issuer": "Sitecore",
      "year": "2024",
      "description": ""
    },
    {
      "name": "AWS Certified Data Engineer - Associate",
      "issuer": "AWS",
      "year": "2022",
      "description": ""
    }
  ],
  "id": "77c61f26-5a98-44ad-bc6a-1cc70c175733"
}