{
  "name": "Boris Brodsky",
  "title": "Digital Transformation and Innovation | Lifetime learner | Ex-Avanade/Accenture | Sitecore",
  "about": "Boris Test is FTI Consulting's Digital Transformation and Innovation leader. Mr. Test is responsible for driving enterprise digital transformation through cloud computing, composable development, and data-driven solutions. He specializes in leading global teams, delivering large-scale initiatives, and aligning technology with business goals. Passionate about AI, analytics, and cloud-native architectures, he is known for practical innovation, collaboration, and mentorship to create lasting impact.\n\nPrior to his current endeavors, Mr. Test served as Head of Data, Insights and Analytics at Zont Digital, where he spearheaded cloud modernization and data transformation initiatives, enhancing operational efficiency and driving business growth. Before Zont Digital, he held the role of AVP of Digital Products at Verisk, leading the transformation to a modern, cloud-based architecture and managing product analysis, procurement, and integration.\n\nMr. Test spent over eight years at Avanade, where he held various leadership roles, including Director of Technology Leadership and Digital Application Architect. At Avanade, he directed architecture, strategy, planning, and presales of cloud-based DXP solutions, ensuring on-time and cost-effective delivery of projects. He also led digital transformations for major global businesses in MarTech, Health, Automotive, and Energy industries.\n\nEarlier in his career, Mr. Test co-founded IMstek, where he led strategic partnerships and technology integration for Sitecore DMS Customer Engagement Platform. He also held roles at StraighterLine, Laureate Education, Crawford Media Services, and Planit, contributing to web application development, software engineering, and digital transformation initiatives.\n\nMr. Test holds a Master's degree in Information Technology and a Post Graduate Certificate in Database Management from Towson University. He also earned a Bachelor's degree in Archaeology from the University of Haifa and a Bachelor's degree (equivalent) in Electrical Engineering from Irkutsk State Technical University. He is a Sitecore Technology MVP and has received multiple honors and awards for his contributions to the field.",
  "contact": "",
  "office": "Baltimore, Maryland, United States",
  "imageUrl": "",
  "email": "boris@imstek.com",
  "phone": "4106984493",
  "industries": [
    "Digital Transformation",
    "Cloud Computing",
    "AI",
    "Analytics"
  ],
  "education": [
    {
      "degree": "Master's degree, Information Technology",
      "institution": "Towson University",
      "year": "2004-2007",
      "description": ""
    },
    {
      "degree": "Post Graduate Certificate, Database Management",
      "institution": "Towson University",
      "year": "2007",
      "description": ""
    },
    {
      "degree": "Bachelor's Degree, Archaeology",
      "institution": "University of Haifa",
      "year": "",
      "description": ""
    },
    {
      "degree": "Bachelor's Degree (equivalent), Electrical Engineering",
      "institution": "Irkutsk State Technical University",
      "year": "",
      "description": ""
    }
  ],
  "certifications": [
    {
      "name": "Sitecore Certified Platform Associate Developer (Version 9)",
      "issuer": "Sitecore",
      "year": "",
      "description": ""
    },
    {
      "name": "Sitecore Technology MVP (2018-2023)",
      "issuer": "Sitecore",
      "year": "",
      "description": ""
    },
    {
      "name": "Microsoft Certified: Azure Developer Associate",
      "issuer": "Microsoft",
      "year": "",
      "description": ""
    },
    {
      "name": "Microsoft Certified: Azure Solutions Architect",
      "issuer": "Microsoft",
      "year": "",
      "description": ""
    },
    {
      "name": "Sitecore Symposium Speaker",
      "issuer": "Sitecore",
      "year": "",
      "description": ""
    }
  ],
  "id": "e5e14f5d-be41-4f1e-94c9-18466f219f6a"
}